[Killed] BooleanLiteral
src/contexts/AuthContext.tsx:20:42
 
 export function AuthProvider({ children }: { children: ReactNode }) {
   const [user, setUser] = useState<CurrentUser | null>(null);
-  const [loading, setLoading] = useState(true);
+  const [loading, setLoading] = useState(false);
 
   useEffect(() => {
killedBy: Auth Integration Tests AuthContext Integration should provide authentication state through context
statusReason: TestingLibraryElementError: Unable to find an element with the text: Loading.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <span
        data-testid="auth-status"

[Killed] BlockStatement
src/contexts/AuthContext.tsx:22:19
   const [user, setUser] = useState<CurrentUser | null>(null);
   const [loading, setLoading] = useState(true);
 
-  useEffect(() => {
-    async function checkAuth() {
-      try {
-        const token = localStorage.getItem('accessToken');
-        if (token) {
-          const userData = await getCurrentUser();
-          setUser(userData);
-        }
-      } catch (error) {
-        console.error('Auth check failed:', error);
-        localStorage.removeItem('accessToken');
-        localStorage.removeItem('refreshToken');
-      } finally {
-        setLoading(false);
-      }
-    }
-
-    checkAuth();
-  }, []);
+  useEffect(() => {}, []);
 
   const login = (userData: CurrentUser) => {
killedBy: Auth Integration Tests AuthContext Integration should provide authentication state through context
statusReason: Error: Unable to find an element by: [data-testid="auth-status"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      Loading...
    </div>

[Killed] BlockStatement
src/contexts/AuthContext.tsx:23:32
   const [loading, setLoading] = useState(true);
 
   useEffect(() => {
-    async function checkAuth() {
-      try {
-        const token = localStorage.getItem('accessToken');
-        if (token) {
-          const userData = await getCurrentUser();
-          setUser(userData);
-        }
-      } catch (error) {
-        console.error('Auth check failed:', error);
-        localStorage.removeItem('accessToken');
-        localStorage.removeItem('refreshToken');
-      } finally {
-        setLoading(false);
-      }
-    }
+    async function checkAuth() {}
 
     checkAuth();
killedBy: Auth Integration Tests AuthContext Integration should provide authentication state through context
statusReason: Error: Unable to find an element by: [data-testid="auth-status"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      Loading...
    </div>

[Killed] BlockStatement
src/contexts/AuthContext.tsx:24:11
 
   useEffect(() => {
     async function checkAuth() {
-      try {
-        const token = localStorage.getItem('accessToken');
-        if (token) {
-          const userData = await getCurrentUser();
-          setUser(userData);
-        }
-      } catch (error) {
+      try {} catch (error) {
         console.error('Auth check failed:', error);
         localStorage.removeItem('accessToken');
killedBy: Auth Integration Tests AuthContext Integration should provide authentication state through context
statusReason: TestingLibraryElementError: Unable to find an element with the text: Loading.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <span
        data-testid="auth-status"

[NoCoverage] BlockStatement
src/contexts/AuthContext.tsx:30:23
           const userData = await getCurrentUser();
           setUser(userData);
         }
-      } catch (error) {
-        console.error('Auth check failed:', error);
-        localStorage.removeItem('accessToken');
-        localStorage.removeItem('refreshToken');
-      } finally {
+      } catch (error) {} finally {
         setLoading(false);
       }

[Killed] BlockStatement
src/contexts/AuthContext.tsx:34:17
         console.error('Auth check failed:', error);
         localStorage.removeItem('accessToken');
         localStorage.removeItem('refreshToken');
-      } finally {
-        setLoading(false);
-      }
+      } finally {}
     }
 
killedBy: Auth Integration Tests AuthContext Integration should provide authentication state through context
statusReason: Error: Unable to find an element by: [data-testid="auth-status"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      Loading...
    </div>

[Killed] BlockStatement
src/contexts/AuthContext.tsx:42:44
     checkAuth();
   }, []);
 
-  const login = (userData: CurrentUser) => {
-    setUser(userData);
-  };
+  const login = (userData: CurrentUser) => {};
 
   const logout = async () => {
killedBy: AuthContext should set user on login
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"email": "test@test.com", "id": "1", "isStaff": false, "profile": null, "username": "testuser"}
Received: null

[Killed] BlockStatement
src/contexts/AuthContext.tsx:46:30
     setUser(userData);
   };
 
-  const logout = async () => {
-    await logoutService();
-    setUser(null);
-  };
+  const logout = async () => {};
 
   return (
killedBy: AuthContext should clear user on logout
statusReason: Error: expect(received).toBeNull()

Received: {"email": "test@test.com", "id": "1", "isStaff": false, "profile": null, "username": "testuser"}

[Killed] ObjectLiteral
src/contexts/AuthContext.tsx:53:14
 
   return (
     <AuthContext.Provider
-      value={{
-        user,
-        loading,
-        isAuthenticated: !!user,
-        login,
-        logout,
-      }}
+      value={{}}
     >
       {children}
killedBy: Auth Integration Tests AuthContext Integration should provide authentication state through context
statusReason: TestingLibraryElementError: Unable to find an element with the text: Loading.... This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <span
        data-testid="auth-status"

[Killed] BooleanLiteral
src/contexts/AuthContext.tsx:56:26
       value={{
         user,
         loading,
-        isAuthenticated: !!user,
+        isAuthenticated: !user,
         login,
         logout,
killedBy: AuthContext should load user on mount if token exists
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/contexts/AuthContext.tsx:67:27
 }
 
 // Хук для использования в компонентах
-export function useAuth() {
-  const context = useContext(AuthContext);
-  if (!context) {
-    throw new Error('useAuth must be used within AuthProvider');
-  }
-  return context;
-}
+export function useAuth() {}
 
killedBy: Auth Integration Tests Login Flow should successfully login with valid credentials
statusReason: TypeError: Cannot destructure property 'login' of '(0 , _AuthContext.useAuth)(...)' as it is undefined.

[Killed] ConditionalExpression
src/contexts/AuthContext.tsx:69:7
 // Хук для использования в компонентах
 export function useAuth() {
   const context = useContext(AuthContext);
-  if (!context) {
+  if (true) {
     throw new Error('useAuth must be used within AuthProvider');
   }
killedBy: Auth Integration Tests Login Flow should successfully login with valid credentials
statusReason: Error: useAuth must be used within AuthProvider
