[NoCoverage] BlockStatement
src/services/answers.service.ts:8:76
 /**
  * Отправляет новый ответ на сервер
  */
-export async function createAnswer(data: CreateAnswerDto): Promise<Answer> {
-  // Мы предполагаем, что твой API принимает POST-запрос на /answers
-  return apiClient<Answer>('/answers', {
-    method: 'POST',
-    body: data,
-  });
-}
+export async function createAnswer(data: CreateAnswerDto): Promise<Answer> {}
 
