[NoCoverage] BlockStatement
src/services/forms.service.ts:6:54
 import { SubmitResponseDto } from '@/types/response.types';
 
 // Получить все формы
-export async function getAllForms(): Promise<Form[]> {
-  return apiClient<Form[]>('/forms');
-}
+export async function getAllForms(): Promise<Form[]> {}
 
 // Получить форму по ID

[NoCoverage] BlockStatement
src/services/forms.service.ts:11:62
 }
 
 // Получить форму по ID
-export async function getFormById(id: number): Promise<Form> {
-  return apiClient<Form>(`/forms/${id}`);
-}
+export async function getFormById(id: number): Promise<Form> {}
 
 // Создать форму

[NoCoverage] StringLiteral
src/services/forms.service.ts:12:26
 
 // Получить форму по ID
 export async function getFormById(id: number): Promise<Form> {
-  return apiClient<Form>(`/forms/${id}`);
+  return apiClient<Form>(``);
 }
 

[NoCoverage] BlockStatement
src/services/forms.service.ts:16:70
 }
 
 // Создать форму
-export async function createForm(data: CreateFormDto): Promise<Form> {
-  return apiClient<Form>('/forms', {
-    method: 'POST',
-    body: data,
-  });
-}
+export async function createForm(data: CreateFormDto): Promise<Form> {}
 
 // Получить вопросы формы

[NoCoverage] StringLiteral
src/services/forms.service.ts:18:13
 // Создать форму
 export async function createForm(data: CreateFormDto): Promise<Form> {
   return apiClient<Form>('/forms', {
-    method: 'POST',
+    method: "",
     body: data,
   });

[NoCoverage] BlockStatement
src/services/forms.service.ts:24:77
 }
 
 // Получить вопросы формы
-export async function getFormQuestions(formId: number): Promise<Question[]> {
-  return apiClient<Question[]>(`/forms/${formId}/questions`);
-}
+export async function getFormQuestions(formId: number): Promise<Question[]> {}
 
 // Отправить ответы на форму

[NoCoverage] BlockStatement
src/services/forms.service.ts:29:97
 }
 
 // Отправить ответы на форму
-export async function submitFormResponse({ formId, answers }: SubmitResponseDto): Promise<void> {
-  return apiClient(`/responses`, {
-    method: 'POST',
-    body: {
-      formId,
-      answers,
-    },
-  });
-}
+export async function submitFormResponse({ formId, answers }: SubmitResponseDto): Promise<void> {}
 
