[Killed] BlockStatement
src/lib/api/client.ts:10:27
   requiresAuth?: boolean;
 }
 
-function getAccessToken() {
-  if (typeof window === 'undefined') return null;
-  return localStorage.getItem('accessToken');
-}
+function getAccessToken() {}
 
 export async function apiClient<T>(endpoint: string, config: RequestConfig = {}): Promise<T> {
killedBy: API Client should add Authorization header when requiresAuth is true
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<String>, ObjectContaining {"headers": ObjectContaining {"Authorization": "Bearer test-token"}}
Received: "https://uniform-api-6nnh.onrender.com/test", {"headers": {"Content-Type": "application/json"}, "method": "GET"}

Number of calls: 1

[Killed] ConditionalExpression
src/lib/api/client.ts:11:7
 }
 
 function getAccessToken() {
-  if (typeof window === 'undefined') return null;
+  if (true) return null;
   return localStorage.getItem('accessToken');
 }
killedBy: API Client should add Authorization header when requiresAuth is true
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<String>, ObjectContaining {"headers": ObjectContaining {"Authorization": "Bearer test-token"}}
Received: "https://uniform-api-6nnh.onrender.com/test", {"headers": {"Content-Type": "application/json"}, "method": "GET"}

Number of calls: 1

[Killed] EqualityOperator
src/lib/api/client.ts:11:7
 }
 
 function getAccessToken() {
-  if (typeof window === 'undefined') return null;
+  if (typeof window !== 'undefined') return null;
   return localStorage.getItem('accessToken');
 }
killedBy: API Client should add Authorization header when requiresAuth is true
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<String>, ObjectContaining {"headers": ObjectContaining {"Authorization": "Bearer test-token"}}
Received: "https://uniform-api-6nnh.onrender.com/test", {"headers": {"Content-Type": "application/json"}, "method": "GET"}

Number of calls: 1

[Killed] StringLiteral
src/lib/api/client.ts:12:31
 
 function getAccessToken() {
   if (typeof window === 'undefined') return null;
-  return localStorage.getItem('accessToken');
+  return localStorage.getItem("");
 }
 
killedBy: API Client should add Authorization header when requiresAuth is true
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<String>, ObjectContaining {"headers": ObjectContaining {"Authorization": "Bearer test-token"}}
Received: "https://uniform-api-6nnh.onrender.com/test", {"headers": {"Content-Type": "application/json"}, "method": "GET"}

Number of calls: 1

[Killed] StringLiteral
src/lib/api/client.ts:17:14
 
 export async function apiClient<T>(endpoint: string, config: RequestConfig = {}): Promise<T> {
   const {
-    method = 'GET',
+    method = "",
     body,
     headers = {},
killedBy: API Client should make GET request with default method
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "/test", ObjectContaining {"method": "GET"}
Received: "https://uniform-api-6nnh.onrender.com/test", {"headers": {"Content-Type": "application/json"}, "method": ""}

Number of calls: 1

[Survived] BooleanLiteral
src/lib/api/client.ts:20:20
     method = 'GET',
     body,
     headers = {},
-    requiresAuth = true, // по умолчанию требуется авторизация
+    requiresAuth = false, // по умолчанию требуется авторизация
   } = config;
 

[Killed] BlockStatement
src/lib/api/client.ts:27:21
     'Content-Type': 'application/json',
   };
 
-  if (requiresAuth) {
-    const token = getAccessToken();
-    if (token) {
-      defaultHeaders['Authorization'] = `Bearer ${token}`;
-    }
-  }
+  if (requiresAuth) {}
 
   const fetchConfig: RequestInit = {
killedBy: API Client should add Authorization header when requiresAuth is true
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<String>, ObjectContaining {"headers": ObjectContaining {"Authorization": "Bearer test-token"}}
Received: "https://uniform-api-6nnh.onrender.com/test", {"headers": {"Content-Type": "application/json"}, "method": "GET"}

Number of calls: 1

[Killed] ConditionalExpression
src/lib/api/client.ts:27:7
     'Content-Type': 'application/json',
   };
 
-  if (requiresAuth) {
+  if (false) {
     const token = getAccessToken();
     if (token) {
killedBy: API Client should add Authorization header when requiresAuth is true
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<String>, ObjectContaining {"headers": ObjectContaining {"Authorization": "Bearer test-token"}}
Received: "https://uniform-api-6nnh.onrender.com/test", {"headers": {"Content-Type": "application/json"}, "method": "GET"}

Number of calls: 1

[Killed] BlockStatement
src/lib/api/client.ts:29:16
 
   if (requiresAuth) {
     const token = getAccessToken();
-    if (token) {
-      defaultHeaders['Authorization'] = `Bearer ${token}`;
-    }
+    if (token) {}
   }
 
killedBy: API Client should add Authorization header when requiresAuth is true
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<String>, ObjectContaining {"headers": ObjectContaining {"Authorization": "Bearer test-token"}}
Received: "https://uniform-api-6nnh.onrender.com/test", {"headers": {"Content-Type": "application/json"}, "method": "GET"}

Number of calls: 1

[Killed] ConditionalExpression
src/lib/api/client.ts:29:9
 
   if (requiresAuth) {
     const token = getAccessToken();
-    if (token) {
+    if (false) {
       defaultHeaders['Authorization'] = `Bearer ${token}`;
     }
killedBy: API Client should add Authorization header when requiresAuth is true
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<String>, ObjectContaining {"headers": ObjectContaining {"Authorization": "Bearer test-token"}}
Received: "https://uniform-api-6nnh.onrender.com/test", {"headers": {"Content-Type": "application/json"}, "method": "GET"}

Number of calls: 1

[Killed] ObjectLiteral
src/lib/api/client.ts:36:14
 
   const fetchConfig: RequestInit = {
     method,
-    headers: { ...defaultHeaders, ...headers },
+    headers: {},
   };
 
killedBy: API Client should add Authorization header when requiresAuth is true
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<String>, ObjectContaining {"headers": ObjectContaining {"Authorization": "Bearer test-token"}}
Received: "https://uniform-api-6nnh.onrender.com/test", {"headers": {}, "method": "GET"}

Number of calls: 1

[Killed] ConditionalExpression
src/lib/api/client.ts:39:7
     headers: { ...defaultHeaders, ...headers },
   };
 
-  if (body && ['POST', 'PUT', 'PATCH', 'DELETE'].includes(method)) {
+  if (false) {
     fetchConfig.body = JSON.stringify(body);
   }
killedBy: API Client should include body in POST request
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<String>, ObjectContaining {"body": "{\"email\":\"test@test.com\",\"password\":\"123\"}", "method": "POST"}
Received: "https://uniform-api-6nnh.onrender.com/test", {"headers": {"Content-Type": "application/json"}, "method": "POST"}

Number of calls: 1

[Killed] BlockStatement
src/lib/api/client.ts:39:68
     headers: { ...defaultHeaders, ...headers },
   };
 
-  if (body && ['POST', 'PUT', 'PATCH', 'DELETE'].includes(method)) {
-    fetchConfig.body = JSON.stringify(body);
-  }
+  if (body && ['POST', 'PUT', 'PATCH', 'DELETE'].includes(method)) {}
 
   try {
killedBy: API Client should include body in POST request
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: Any<String>, ObjectContaining {"body": "{\"email\":\"test@test.com\",\"password\":\"123\"}", "method": "POST"}
Received: "https://uniform-api-6nnh.onrender.com/test", {"headers": {"Content-Type": "application/json"}, "method": "POST"}

Number of calls: 1

[Killed] BlockStatement
src/lib/api/client.ts:43:7
     fetchConfig.body = JSON.stringify(body);
   }
 
-  try {
-    const response = await fetch(`${API_GATEWAY_URL}${endpoint}`, fetchConfig);
-
-    if (response.status === 401) {
-      if (typeof window !== 'undefined') {
-        localStorage.removeItem('accessToken');
-        window.location.href = '/login';
-      }
-      throw new Error('Unauthorized');
-    }
-
-    if (!response.ok) {
-      const error = await response.json().catch(() => ({ message: 'Unknown error' }));
-      throw new Error(error.message || `HTTP Error: ${response.status}`);
-    }
-
-    const data = await response.json();
-    return data;
-  } catch (error) {
+  try {} catch (error) {
     console.error('API Client Error:', error);
     throw error;
killedBy: Auth Integration Tests Login Flow should successfully login with valid credentials
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "mock-access-token"
Received: null

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
src/lib/api/client.ts:44:34
   }
 
   try {
-    const response = await fetch(`${API_GATEWAY_URL}${endpoint}`, fetchConfig);
+    const response = await fetch(``, fetchConfig);
 
     if (response.status === 401) {
killedBy: API Client should make GET request with default method
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: StringContaining "/test", ObjectContaining {"method": "GET"}
Received: "", {"headers": {"Content-Type": "application/json"}, "method": "GET"}

Number of calls: 1

[Killed] EqualityOperator
src/lib/api/client.ts:46:9
   try {
     const response = await fetch(`${API_GATEWAY_URL}${endpoint}`, fetchConfig);
 
-    if (response.status === 401) {
+    if (response.status !== 401) {
       if (typeof window !== 'undefined') {
         localStorage.removeItem('accessToken');
killedBy: Auth Integration Tests Login Flow should successfully login with valid credentials
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "mock-access-token"
Received: null

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
src/lib/api/client.ts:46:9
   try {
     const response = await fetch(`${API_GATEWAY_URL}${endpoint}`, fetchConfig);
 
-    if (response.status === 401) {
+    if (true) {
       if (typeof window !== 'undefined') {
         localStorage.removeItem('accessToken');
killedBy: Auth Integration Tests Login Flow should successfully login with valid credentials
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "mock-access-token"
Received: null

Ignored nodes: comments, script, style
<html>
  <head />

[Survived] ConditionalExpression
src/lib/api/client.ts:47:11
     const response = await fetch(`${API_GATEWAY_URL}${endpoint}`, fetchConfig);
 
     if (response.status === 401) {
-      if (typeof window !== 'undefined') {
+      if (true) {
         localStorage.removeItem('accessToken');
         window.location.href = '/login';

[Survived] BlockStatement
src/lib/api/client.ts:47:42
     const response = await fetch(`${API_GATEWAY_URL}${endpoint}`, fetchConfig);
 
     if (response.status === 401) {
-      if (typeof window !== 'undefined') {
-        localStorage.removeItem('accessToken');
-        window.location.href = '/login';
-      }
+      if (typeof window !== 'undefined') {}
       throw new Error('Unauthorized');
     }

[Survived] ArrowFunction
src/lib/api/client.ts:55:49
     }
 
     if (!response.ok) {
-      const error = await response.json().catch(() => ({ message: 'Unknown error' }));
+      const error = await response.json().catch(() => undefined);
       throw new Error(error.message || `HTTP Error: ${response.status}`);
     }

[Survived] LogicalOperator
src/lib/api/client.ts:56:23
 
     if (!response.ok) {
       const error = await response.json().catch(() => ({ message: 'Unknown error' }));
-      throw new Error(error.message || `HTTP Error: ${response.status}`);
+      throw new Error(error.message && `HTTP Error: ${response.status}`);
     }
 

[Survived] ConditionalExpression
src/lib/api/client.ts:56:23
 
     if (!response.ok) {
       const error = await response.json().catch(() => ({ message: 'Unknown error' }));
-      throw new Error(error.message || `HTTP Error: ${response.status}`);
+      throw new Error(true);
     }
 

[Killed] BlockStatement
src/lib/api/client.ts:61:19
 
     const data = await response.json();
     return data;
-  } catch (error) {
-    console.error('API Client Error:', error);
-    throw error;
-  }
+  } catch (error) {}
 }
 
killedBy: API Client should throw error on 401 response
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined
