[Killed] BlockStatement
src/services/auth.service.ts:4:75
 import { apiClient } from '@/lib/api/client';
 import { LoginDto, RegisterDto, AuthResponse, CurrentUser } from '@/types/auth.types';
 
-export async function login(credentials: LoginDto): Promise<AuthResponse> {
-  const response = await apiClient<AuthResponse>('/auth/login', {
-    method: 'POST',
-    body: credentials,
-    requiresAuth: false,
-  });
-
-  if (typeof window !== 'undefined') {
-    localStorage.setItem('accessToken', response.accessToken);
-    localStorage.setItem('refreshToken', response.refreshToken);
-  }
-
-  return response;
-}
+export async function login(credentials: LoginDto): Promise<AuthResponse> {}
 
 export async function register(userData: RegisterDto): Promise<AuthResponse> {
killedBy: Auth Integration Tests Login Flow should successfully login with valid credentials
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "mock-access-token"
Received: null

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BooleanLiteral
src/services/auth.service.ts:8:19
   const response = await apiClient<AuthResponse>('/auth/login', {
     method: 'POST',
     body: credentials,
-    requiresAuth: false,
+    requiresAuth: true,
   });
 
killedBy: Auth Service login should call apiClient with correct parameters
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "/auth/login",
@@ -2,7 +2,7 @@
    "body": Object {

[Killed] BlockStatement
src/services/auth.service.ts:11:38
     requiresAuth: false,
   });
 
-  if (typeof window !== 'undefined') {
-    localStorage.setItem('accessToken', response.accessToken);
-    localStorage.setItem('refreshToken', response.refreshToken);
-  }
+  if (typeof window !== 'undefined') {}
 
   return response;
killedBy: Auth Integration Tests Login Flow should successfully login with valid credentials
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "mock-access-token"
Received: null

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
src/services/auth.service.ts:19:78
   return response;
 }
 
-export async function register(userData: RegisterDto): Promise<AuthResponse> {
-  const response = await apiClient<AuthResponse>('/auth/register', {
-    method: 'POST',
-    body: userData,
-    requiresAuth: false,
-  });
-
-  if (typeof window !== 'undefined') {
-    localStorage.setItem('accessToken', response.accessToken);
-    localStorage.setItem('refreshToken', response.refreshToken);
-  }
-
-  return response;
-}
+export async function register(userData: RegisterDto): Promise<AuthResponse> {}
 
 export async function logout(): Promise<void> {
killedBy: Auth Integration Tests Registration Flow should successfully register new user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "mock-access-token"
Received: null

Ignored nodes: comments, script, style
<html>
  <head />

[Survived] ObjectLiteral
src/services/auth.service.ts:20:68
 }
 
 export async function register(userData: RegisterDto): Promise<AuthResponse> {
-  const response = await apiClient<AuthResponse>('/auth/register', {
-    method: 'POST',
-    body: userData,
-    requiresAuth: false,
-  });
+  const response = await apiClient<AuthResponse>('/auth/register', {});
 
   if (typeof window !== 'undefined') {

[Survived] StringLiteral
src/services/auth.service.ts:21:13
 
 export async function register(userData: RegisterDto): Promise<AuthResponse> {
   const response = await apiClient<AuthResponse>('/auth/register', {
-    method: 'POST',
+    method: "",
     body: userData,
     requiresAuth: false,

[Survived] BooleanLiteral
src/services/auth.service.ts:23:19
   const response = await apiClient<AuthResponse>('/auth/register', {
     method: 'POST',
     body: userData,
-    requiresAuth: false,
+    requiresAuth: true,
   });
 

[Killed] StringLiteral
src/services/auth.service.ts:27:26
   });
 
   if (typeof window !== 'undefined') {
-    localStorage.setItem('accessToken', response.accessToken);
+    localStorage.setItem("", response.accessToken);
     localStorage.setItem('refreshToken', response.refreshToken);
   }
killedBy: Auth Integration Tests Registration Flow should successfully register new user
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "mock-access-token"
Received: null

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
src/services/auth.service.ts:34:47
   return response;
 }
 
-export async function logout(): Promise<void> {
-  if (typeof window !== 'undefined') {
-    localStorage.removeItem('accessToken');
-    localStorage.removeItem('refreshToken');
-  }
-
-  try {
-    await apiClient('/auth/logout', {
-      method: 'POST',
-    });
-  } catch (error) {
-    console.error('Failed to logout:', error);
-    throw error;
-  }
-}
+export async function logout(): Promise<void> {}
 
 export async function getCurrentUser(): Promise<CurrentUser> {
killedBy: Auth Service logout should remove tokens from localStorage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "accessToken"

Number of calls: 0

[Killed] BlockStatement
src/services/auth.service.ts:35:38
 }
 
 export async function logout(): Promise<void> {
-  if (typeof window !== 'undefined') {
-    localStorage.removeItem('accessToken');
-    localStorage.removeItem('refreshToken');
-  }
+  if (typeof window !== 'undefined') {}
 
   try {
killedBy: Auth Service logout should remove tokens from localStorage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "accessToken"

Number of calls: 0

[Killed] EqualityOperator
src/services/auth.service.ts:35:7
 }
 
 export async function logout(): Promise<void> {
-  if (typeof window !== 'undefined') {
+  if (typeof window === 'undefined') {
     localStorage.removeItem('accessToken');
     localStorage.removeItem('refreshToken');
killedBy: Auth Service logout should remove tokens from localStorage
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "accessToken"

Number of calls: 0

[Killed] BlockStatement
src/services/auth.service.ts:40:7
     localStorage.removeItem('refreshToken');
   }
 
-  try {
-    await apiClient('/auth/logout', {
-      method: 'POST',
-    });
-  } catch (error) {
+  try {} catch (error) {
     console.error('Failed to logout:', error);
     throw error;
killedBy: Auth Service logout should call logout endpoint
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/auth/logout", {"method": "POST"}

Number of calls: 0

[NoCoverage] BlockStatement
src/services/auth.service.ts:44:19
     await apiClient('/auth/logout', {
       method: 'POST',
     });
-  } catch (error) {
-    console.error('Failed to logout:', error);
-    throw error;
-  }
+  } catch (error) {}
 }
 

[NoCoverage] StringLiteral
src/services/auth.service.ts:45:19
       method: 'POST',
     });
   } catch (error) {
-    console.error('Failed to logout:', error);
+    console.error("", error);
     throw error;
   }

[Killed] BlockStatement
src/services/auth.service.ts:50:62
   }
 }
 
-export async function getCurrentUser(): Promise<CurrentUser> {
-  return apiClient<CurrentUser>('/auth/me');
-}
+export async function getCurrentUser(): Promise<CurrentUser> {}
 
 // === ОБНОВИТЬ ТОКЕН ===
killedBy: Auth Integration Tests AuthContext Integration should provide authentication state through context
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Authenticated
Received:
  Not authenticated

Ignored nodes: comments, script, style

[Killed] StringLiteral
src/services/auth.service.ts:51:33
 }
 
 export async function getCurrentUser(): Promise<CurrentUser> {
-  return apiClient<CurrentUser>('/auth/me');
+  return apiClient<CurrentUser>("");
 }
 
killedBy: Auth Integration Tests AuthContext Integration should provide authentication state through context
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Authenticated
Received:
  Not authenticated

Ignored nodes: comments, script, style

[NoCoverage] BlockStatement
src/services/auth.service.ts:55:61
 }
 
 // === ОБНОВИТЬ ТОКЕН ===
-export async function refreshAccessToken(): Promise<string> {
-  const refreshToken = localStorage.getItem('refreshToken');
-
-  if (!refreshToken) {
-    throw new Error('No refresh token found');
-  }
-
-  const response = await apiClient<{ accessToken: string }>('/auth/refresh', {
-    method: 'POST',
-    body: { refreshToken },
-    requiresAuth: false,
-  });
-
-  localStorage.setItem('accessToken', response.accessToken);
-  return response.accessToken;
-}
+export async function refreshAccessToken(): Promise<string> {}
 

[NoCoverage] StringLiteral
src/services/auth.service.ts:56:45
 
 // === ОБНОВИТЬ ТОКЕН ===
 export async function refreshAccessToken(): Promise<string> {
-  const refreshToken = localStorage.getItem('refreshToken');
+  const refreshToken = localStorage.getItem("");
 
   if (!refreshToken) {

[NoCoverage] BlockStatement
src/services/auth.service.ts:58:22
 export async function refreshAccessToken(): Promise<string> {
   const refreshToken = localStorage.getItem('refreshToken');
 
-  if (!refreshToken) {
-    throw new Error('No refresh token found');
-  }
+  if (!refreshToken) {}
 
   const response = await apiClient<{ accessToken: string }>('/auth/refresh', {

[NoCoverage] ObjectLiteral
src/services/auth.service.ts:64:11
 
   const response = await apiClient<{ accessToken: string }>('/auth/refresh', {
     method: 'POST',
-    body: { refreshToken },
+    body: {},
     requiresAuth: false,
   });

[NoCoverage] BooleanLiteral
src/services/auth.service.ts:65:19
   const response = await apiClient<{ accessToken: string }>('/auth/refresh', {
     method: 'POST',
     body: { refreshToken },
-    requiresAuth: false,
+    requiresAuth: true,
   });
 
