[NoCoverage] BlockStatement
src/services/questions.service.ts:10:62
 } from '@/types/question.types';
 
 // Получить ВСЕ вопросы (для списка)
-export async function getAllQuestions(): Promise<Question[]> {
-  // Мы предполагаем, что твой API отдает список вопросов по этому эндпоинту
-  return apiClient<Question[]>('/questions');
-}
+export async function getAllQuestions(): Promise<Question[]> {}
 
 // Получить ОДИН вопрос (для страницы просмотра)

[NoCoverage] BlockStatement
src/services/questions.service.ts:16:81
 }
 
 // Получить ОДИН вопрос (для страницы просмотра)
-export async function getQuestionById(id: number): Promise<QuestionWithDetails> {
-  return apiClient<QuestionWithDetails>(`/questions/${id}`);
-}
+export async function getQuestionById(id: number): Promise<QuestionWithDetails> {}
 
 // Создать вопрос

[NoCoverage] BlockStatement
src/services/questions.service.ts:21:82
 }
 
 // Создать вопрос
-export async function createQuestion(data: CreateQuestionDto): Promise<Question> {
-  return apiClient<Question>('/questions', {
-    method: 'POST',
-    body: data,
-  });
-}
+export async function createQuestion(data: CreateQuestionDto): Promise<Question> {}
 
 // (Может понадобиться в будущем)

[NoCoverage] BlockStatement
src/services/questions.service.ts:30:94
 
 // (Может понадобиться в будущем)
 // Обновить вопрос
-export async function updateQuestion(id: number, data: UpdateQuestionDto): Promise<Question> {
-  return apiClient<Question>(`/questions/${id}`, {
-    method: 'PUT', // или 'PUT'
-    body: data,
-  });
-}
+export async function updateQuestion(id: number, data: UpdateQuestionDto): Promise<Question> {}
 

[NoCoverage] StringLiteral
src/services/questions.service.ts:31:30
 // (Может понадобиться в будущем)
 // Обновить вопрос
 export async function updateQuestion(id: number, data: UpdateQuestionDto): Promise<Question> {
-  return apiClient<Question>(`/questions/${id}`, {
+  return apiClient<Question>(``, {
     method: 'PUT', // или 'PUT'
     body: data,

[NoCoverage] StringLiteral
src/services/questions.service.ts:32:13
 // Обновить вопрос
 export async function updateQuestion(id: number, data: UpdateQuestionDto): Promise<Question> {
   return apiClient<Question>(`/questions/${id}`, {
-    method: 'PUT', // или 'PUT'
+    method: "", // или 'PUT'
     body: data,
   });
