[NoCoverage] BlockStatement
src/services/responses.service.ts:8:88
  * Получить все ответы (submissions) для конкретной формы.
  * Это может быть полезно для владельца формы (админа).
  */
-export async function getResponsesForForm(formId: number): Promise<FullFormResponse[]> {
-  return apiClient<FullFormResponse[]>(`/responses/form/${formId}`);
-}
+export async function getResponsesForForm(formId: number): Promise<FullFormResponse[]> {}
 
 /**

[NoCoverage] BlockStatement
src/services/responses.service.ts:15:86
 /**
  * Получить конкретный ответ (submission) по его ID.
  */
-export async function getResponseById(responseId: number): Promise<FullFormResponse> {
-  return apiClient<FullFormResponse>(`/responses/${responseId}`);
-}
+export async function getResponseById(responseId: number): Promise<FullFormResponse> {}
 
 /**

[NoCoverage] BlockStatement
src/services/responses.service.ts:22:69
 /**
  * Получить все ответы (submissions), отправленные текущим пользователем.
  */
-export async function getMyResponses(): Promise<FullFormResponse[]> {
-  // apiClient по умолчанию 'requiresAuth = true',
-  // поэтому токен пользователя будет автоматически прикреплен.
-  return apiClient<FullFormResponse[]>(`/responses/my`);
-}
+export async function getMyResponses(): Promise<FullFormResponse[]> {}
 
